# MiddleSupportType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..MiddleSupportType Property
StairsType Class See Also
---
The type of middle supports used in the stair.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId MiddleSupportType { get; set; }
```

Visual Basic
---
```text
Public Property MiddleSupportType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ MiddleSupportType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Field Value
invalidElementId if the stairs type has no middle support.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: supportType is not a valid middle support type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The stairs type has no middle support so the data being set is not applicable. |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace